Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: There are situations where various Jackson related exceptions need to handled in a uniform way.For example, the application may need to handle all `JsonMappingException` the same way. This becomes a problem when taking JAX-RS / Jakarta REST rules into account, because the exception mapper `ExceptionMapper` for `MismatchedInputException` would be used instead of the user provide `ExceptionMapper` for `JsonMappingException` (as `MismatchedInputException` is a subtype of `JsonMappingException`).
ja_jp: Jackson に関連するさまざまな例外を一律に処理する必要がある状況があります。たとえば、アプリケーションがすべての `JsonMappingException` を同じ方法で処理する必要がある場合です。 しかし、JAX-RS / Jakarta REST のルールを考慮すると、この処理が問題になります。これは、 `MismatchedInputException` は `JsonMappingException` のサブタイプであるため、ユーザーが提供した `JsonMappingException` 用の `ExceptionMapper` ではなく、 `MismatchedInputException` 用の `ExceptionMapper` が使用されてしまうからです。

source: There are some MicroProfile OpenAPI annotations which describe global API information, such as the following:
ja_jp: 以下のようなグローバルAPI情報を記述するMicroProfile OpenAPIアノテーションがあります。

source: There are some classes that should not be loaded in an isolated manner, but that should always be loaded by the system ClassLoader (or whatever ClassLoader is responsible for bootstrapping Quarkus). Most extensions do not need to worry about this, however there are a few cases where this is necessary:
ja_jp: 分離された方法でロードされるべきではないクラスがいくつかありますが、それは常にシステムの ClassLoader(または Quarkus のブートストラップを担当している ClassLoader )によってロードされなければなりません。ほとんどのエクステンションはこのことを気にする必要はありませんが、必要な場合もあります:

source: There are some config options that affect this:
ja_jp: これにはいくつかの設定オプションがあります:

source: There are some dependencies that we can be sure we do not want. This generally happens when a dependency has had a name change (e.g. smallrye-config changing groups from `org.smallrye` to `org.smallrye.config`, the `javax` -> `jakarta` rename). This can cause problems, as if these artifacts end up in the dependency tree out of date classes can be loaded that are not compatible with Quarkus. To deal with this extensions can specify artifacts that should never be loaded. This is done by modifying the `quarkus-bootstrap-maven-plugin` config in the pom (which generates the `quarkus-extension.properties` file). Simply add an `excludedArtifacts` section as shown below:
ja_jp: 依存関係の中には、必要ないと確信できるものもあります。これは一般的に、依存関係の名前が変更された場合に起こります(例:smallrye-configがグループを `org.smallrye` から `org.smallrye.config` に変更した、 `javax` → `jakarta` のリネームなど)。これは問題を引き起こす可能性があります。これらのアーティファクトが依存関係ツリーで終わると、Quarkusと互換性のない古いクラスがロードされる可能性があるからです。この問題に対処するために、エクステンションでは、決してロードしてはいけないアーティファクトを指定することができます。これは、 `quarkus-extension.properties` ファイルを生成する pom の `quarkus-bootstrap-maven-plugin` 設定を変更することで行います。以下のように `excludedArtifacts` セクションを追加するだけです:

source: There are some dependencies that we can be sure we do not want. This generally happens when a dependency has had a name change (e.g. smallrye-config changing groups from `org.smallrye` to `org.smallrye.config`, the `javax` -> `jakarta` rename). This can cause problems, as if these artifacts end up in the dependency tree out of date classes can be loaded that are not compatible with Quarkus. To deal with this, extensions can specify artifacts that should never be loaded. This is done by modifying the `quarkus-extension-maven-plugin` config in the pom (which generates the `quarkus-extension.properties` file). Simply add an `excludedArtifacts` section as shown below:
ja_jp: 依存関係の中には、確実に不要なものがあります。これは通常、依存関係の名前が変更されたときに起こります（例えば、smallrye-config が `org.smallrye` から `org.smallrye.config` にグループを変更したとき、 `javax` から `jakarta` に名前を変更したときなどです）。 このようなアーティファクトが依存関係ツリーに残ってしまうと、Quarkusと互換性のない古いクラスがロードされる可能性があり、問題を引き起こす可能性があります。この問題に対処するために、エクステンションでは、決してロードされないアーティファクトを指定することができます。これは、pomの `quarkus-extension-maven-plugin` を変更することで行います（これにより、 `quarkus-extension.properties`ファイルが生成されます）。以下のように、 `excludedArtifacts`セクションを追加するだけです:

source: There are some internal UI components that you can use, described below
ja_jp: 使用できる内部UIコンポーネントがいくつかあります。

source: There are some restrictions on what can be done in this stage as the Substrate VM disallows some objects in the native executable. For example you should not attempt to listen on a port or start threads in this phase. In addition, it is disallowed to read run time configuration during static initialization.
ja_jp: この段階では、サブストレートVMがネイティブ実行可能ファイルに含まれるいくつかのオブジェクトを許可しないため、実行できる内容にいくつかの制限があります。例えば、この段階でポートのリッスンやスレッドの開始を試みてはいけません。また、Static Init 時に実行時設定を読み取ることも禁止されています。

source: There are still convenience redirects in this case, as `quarkus.http.non-application-root-path` is not the same as `quarkus.http.root-path`. However, these redirects only apply to non-application endpoints controlled by the non-application endpoint root. We've essentially removed the metrics and liveness endpoints from that root, so they won't be redirected. In this configuration, if you request `/root/health`, it will be redirected to `/q/health`. A redirect will not be provided for `/root/health/liveness` or `/root/metrics`.
ja_jp: `quarkus.http.non-application-root-path` は `quarkus.http.root-path` と同じではないので、この場合も利便性の為のリダイレクトがあります。しかし、これらのリダイレクトは、非アプリケーションエンドポイントのルートによって制御される非アプリケーションエンドポイントにのみ適用されます。私たちは、基本的にそのルートからメトリクスとlivenessのエンドポイントを削除しているので、リダイレクトされることはありません。この設定では、 `/root/health` をリクエストすると `/q/health` にリダイレクトされます。 `/root/health/liveness` や `/root/metrics` にはリダイレクトされません。

source: There are still convenience redirects in this case, as `quarkus.http.non-application-root-path` is not the same as `quarkus.http.root-path`. Redirected URLs are still relative to HTTP root, so `/root/metrics` will be redirected to `/q/metrics`.
ja_jp: この場合も、 `quarkus.http.non-application-root-path` と `quarkus.http.root-path` が同一ではない為、利便性の為のリダイレクトが存在します。リダイレクトされた URL はまだ HTTP ルートに対する相対的なものなので、 `/root/metrics` は `/q/metrics` にリダイレクトされます。

source: There are three configuration settings that alter the RBAC Deny behavior:
ja_jp: RBACのDeny動作を変更する設定は3つあります。 :

source: There are three distinct bootstrap phases of a Quarkus app:
ja_jp: Quarkusアプリには、3つの異なるブートストラップフェーズがあります。

source: There are three distinct bootstrap phases of a Quarkus application.
ja_jp: Quarkus アプリケーションには、3 つの異なるブートストラップフェーズがあります。

source: There are times when you may have to add additional entries to the `function.zip` lambda deployment that is generated by the build. To do this, create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java. `zip.native/` if you are doing a native deployment.
ja_jp: ビルドによって生成された `function.zip` Lambda デプロイメントに追加のエントリーを加えなければならない場合があります。これを行うには、 `src/main` 内に `zip.jvm` または `zip.native` ディレクトリーを作成します。Pure Java を実行している場合は `zip.jvm/` を、ネイティブディプロイメントを実行している場合は `zip.native/` を作成します。

source: There are times when you may have to add some additions to the `function.zip` lambda deployment that is generated by the build. To do this, create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java lambda. `zip.native/` if you are doing a native deployment.
ja_jp: ビルドによって生成された `function.zip` Lambda デプロイメントにいくつかの追加を加えなければならない場合があります。これを行うには、 `src/main` 内に `zip.jvm` または `zip.native` ディレクトリーを作成します。Pure Java Lambda を実行している場合は `zip.jvm/` を、ネイティブディプロイメントを実行している場合は `zip.native/` を作成します。

source: There are times when you need to completely customize the serialization of a POJO on a per JAX-RS method basis. For such use cases, the `@io.quarkus.resteasy.reactive.jackson.CustomSerialization` annotation is a great tool, as it allows you to configure a per-method `com.fasterxml.jackson.databind.ObjectWriter` which can be configured at will.
ja_jp: JAX-RS のメソッドごとに POJO のシリアル化を完全にカスタマイズする必要がある場合があります。このような場合、 `@io.quarkus.resteasy.reactive.jackson.CustomSerialization` アノテーションは素晴らしいツールで、自由に設定できる `com.fasterxml.jackson.databind.ObjectWriter` というメソッド単位で設定することが可能です。

source: There are times when you need to completely customize the serialization/deserialization of a POJO on a per Jakarta REST method basis or on a per Jakarta REST resource basis. For such use cases, you can use the `@io.quarkus.resteasy.reactive.jackson.CustomSerialization` and `@io.quarkus.resteasy.reactive.jackson.CustomDeserialization` annotations in the REST method or in the REST resource at class level. These annotations allow you to fully configure the `com.fasterxml.jackson.databind.ObjectWriter`/`com.fasterxml.jackson.databind.ObjectReader`.
ja_jp: Jakarta REST の各メソッド単位、または各リソース単位で、POJO のシリアライズ/デシリアライズを完全にカスタマイズする必要がある場合があります。 そのようなユースケースでは、REST メソッドやリソースのクラスレベルで `@io.quarkus.resteasy.reactive.jackson.CustomSerialization` および `@io.quarkus.resteasy.reactive.jackson.CustomDeserialization` アノテーションを使用できます。 これらのアノテーションを利用することで、 `com.fasterxml.jackson.databind.ObjectWriter` や `com.fasterxml.jackson.databind.ObjectReader` を完全に設定できます。

source: There are times where you may have to add additional entries to the `function.zip` lambda deployment that is generated by the build. To do this create a `zip.jvm` or `zip.native` directory within `src/main`. Create `zip.jvm/` if you are doing a pure Java. `zip.native/` if you are doing a native deployment.
ja_jp: ビルドによって生成される `function.zip` lambda デプロイメントにエントリを追加する必要がある場合があります。これを行うには、 `src/main` 内に `zip.jvm` または `zip.native` ディレクトリを作成します。純粋な Java デプロイを行う場合は `zip.jvm/` を作成します。ネイティブ デプロイを行う場合は `zip.native/` を作成します。

source: There are times you may want to set a specific system properties or other arguments when lambda invokes your native quarkus lambda deployment. If you include a `bootstrap` script file within `zip.native`, the quarkus extension will automatically rename the executable to `runner` within `function.zip` and set the unix mode of the `bootstrap` script to executable.
ja_jp: ラムダがネイティブの quarkus ラムダデプロイメントを起動する際に、特定のシステムプロパティーやその他の引数を設定したい場合があるかもしれません。 `zip.native` 内に `bootstrap` スクリプトファイルを含めると、Quarkus エクステンションは自動的に実行ファイルの名前を `function.zip` 内の `runner` に変更し、 `bootstrap` スクリプトの unix モードを実行ファイルに設定します。

source: There are times you may want to set specific system properties or other arguments when lambda invokes your native Funqy deployment. If you include a `bootstrap` script file within `zip.native`, the Funqy extension will automatically rename the executable to `runner` within `function.zip` and set the unix mode of the `bootstrap` script to executable.
ja_jp: ラムダがネイティブの Funqy デプロイメントを起動する際に、特定のシステムプロパティーやその他の引数を設定したい場合があるかもしれません。 `zip.native` 内に `bootstrap` スクリプトファイルを含めると、Funqy エクステンションは自動的に実行ファイルの名前を `function.zip` 内の `runner` に変更し、 `bootstrap` スクリプトの unix モードを実行ファイルに設定します。

source: There are two `customize` methods, the first one uses gRPC's `ManagedChannelBuilder` as a parameter - to be used with Quarkus' legacy gRPC support, where the other uses `GrpcClientOptions` - to be used with the new Vert.x gRPC support. User should implement the right `customize` method per gRPC support type usage, or both if the customizer is gRPC type neutral.
ja_jp: 2つの `customize` メソッドがあります。最初のメソッドは gRPC の `ManagedChannelBuilder` をパラメータとして使用し、Quarkus のレガシー gRPC サポートで使用します。 もう一方は `GrpcClientOptions` を使用し、新しい Vert.x gRPC サポートで使用します。ユーザーは、gRPCサポートタイプの使用法ごとに適切な `customize` メソッドを実装する必要があります。 カスタマイザーがgRPCタイプに依存しない場合は、両方を実装する必要があります。

source: There are two `customize` methods, the first one uses gRPC's `ServerBuilder` as a parameter - to be used with Quarkus' legacy gRPC support, where the other uses `GrpcServerOptions` - to be used with the new Vert.x gRPC support. User should implement the right `customize` method per gRPC support type usage, or both if the customizer is gRPC type neutral.
ja_jp: `customize` メソッドは2つあり、1つは gRPC の `ServerBuilder` をパラメーターとして使用し、Quarkus のレガシー gRPC サポートで使用されます。もう1つは `GrpcServerOptions` を使用し、新しい Vert.x gRPC サポートで使用されます。ユーザーは、gRPC サポートタイプの使用に応じて適切な `customize` メソッドを実装するか、カスタマイザーが gRPC タイプに依存しない場合は両方を実装する必要があります。

source: There are two broad patterns that extensions can use to interact with an optional metrics extension to add their own metrics:
ja_jp: エクステンションがオプションのメトリクスエクステンションとインタラクトして独自のメトリクスを追加するために使用できる、幅広いパターンが 2 つあります。

source: There are two different approaches that can be used to implement applications that exit.
ja_jp: 終了するアプリケーションを実装するためには、2つの異なるアプローチがあります。

source: There are two different ways to fix this type of issues.
ja_jp: このタイプの問題を解決するには、2 つの方法があります。

source: There are two examples of a library providing its own metrics API:
ja_jp: 独自のメトリクス API を提供するライブラリーの例は 2 つあります。

source: There are two interesting parts in this listing:
ja_jp: このリストには 2 つの興味深い部分があります。

source: There are two levels of contexts:
ja_jp: コンテクストには2つのレベルがあります：

source: There are two main ways for the authentication information to expire: the tokens expired and were not renewed, or an explicit logout operation was triggered.
ja_jp: 認証情報が期限切れになる主な方法は 2 つあります。 トークンの有効期限が切れて更新されなかった場合と、明示的なログアウト操作がトリガーされた場合です。

source: There are two main ways for the authentication information to expire: the tokens expired and were not renewed or an explicit logout operation was triggered.
ja_jp: 認証情報が期限切れになる主な方法は 2 つあります。トークンの有効期限が切れて更新されなかった場合と、明示的なログアウト操作がトリガーされた場合です。

source: There are two modes of operation for how you want to handle user and credential creation:
ja_jp: ユーザーと認証情報の作成を処理する方法には、次の 2 つの操作モードがあります。

source: There are two supported data types: `application/json` and `application/hal+json`. The former is used by default, but it is highly recommended to specify which one you prefer with an `Accept` header.
ja_jp: サポートされているデータタイプは、 `application/json` と `application/hal+json` の2種類です。デフォルトでは前者が使用されますが、 `Accept` のヘッダーでどちらを使用するか指定することを強くお勧めします。

source: There are two things to notice about this function. One, it has no output. Your functions are not required to return output. Second, there is an additional `event` parameter to the function.
ja_jp: この機能には2つの注意点があります。一つは、この関数には出力がありません。あなたの関数は出力を返す必要はありません。第二に、この関数には追加の `event` パラメータがあります。

source: There are two ways to achieve _priming_:
ja_jp: _プライミング_ を実現するには、2つの方法があります。

source: There are two ways to attach model classes to persistence units, and they should not be mixed:
ja_jp: モデルクラスを永続化ユニットにアタッチする方法は2つあり、混在できません:

source: There are two ways to bundle your web assets:
ja_jp: Web アセットをバンドルする方法は 2 つあります。

source: There are two ways to configure the Jaeger tracer within the application.
ja_jp: アプリケーション内でJaeger トレーサーを設定するには、2つの方法があります。

source: There are two ways to configure the OTLP gRPC Exporter within the application.
ja_jp: アプリケーション内でOTLP gRPC Exporterを設定するには2つの方法があります。

source: There are two ways to configure the default OTLP gRPC Exporter within the application.
ja_jp: アプリケーション内でOTLP gRPC エクスポーターを設定するには2つの方法があります。

source: There are two ways to customize the concurrency level:
ja_jp: 同時実行レベルをカスタマイズする方法は 2 つあります。

source: There are two ways to define a type-safe template:
ja_jp: タイプセーフなテンプレートは、2 つの方法で定義できます。

source: There are two ways to make that information available, depending on whether it is available at build time or at run time.
ja_jp: その情報を利用可能にするには、ビルドタイムに利用可能か、ランタイムに利用可能かによって、2つの方法があります。

source: There are various APIS that you can use to integrate with development mode, and to get information about the current state.
ja_jp: 開発モードとの統合や、現在の状態に関する情報を得るために使用できる様々なAPIがあります。

source: There are various hotkeys you can use to control continuous testing. Pressing `h` will display the following list of commands:
ja_jp: 継続的テストをコントロールするために使用できる様々なホットキーがあります。 `h` を押すと、次のようなコマンドの一覧が表示されます。

source: There are various optional properties useful to refine your `EntityManagerFactory` or guide guesses of Quarkus.
ja_jp: `EntityManagerFactory` を改良したり、Quarkusの推測を導くのに便利な様々なオプションのプロパティーがあります。

source: There are various optional properties useful to refine your `EntityViewManager` and `CriteriaBuilderFactory` or guide guesses of Quarkus.
ja_jp: `EntityViewManager` と `CriteriaBuilderFactory` を洗練させたり、またはQuarkusの推測をガイドするのに便利な様々なオプションのプロパティーがあります。

source: There are various optional properties useful to refine your session factory or guide Quarkus' guesses.
ja_jp: セッションファクトリを改良したり、Quarkusの推測を導くのに役立つ様々なオプションのプロパティがあります。

source: There can be only one `ClientHeadersFactory` per class. With it, you can not only add custom headers, but you can also transform existing ones. See the `RequestUUIDHeaderFactory` class below for an example of the factory.
ja_jp: クラスごとに存在できる `ClientHeadersFactory` は 1 つだけです。これを使用すると、カスタムヘッダーを追加できるだけでなく、既存のヘッダーを変換することもできます。ファクトリーの例については、以下の `RequestUUIDHeaderFactory` クラスを参照してください。

source: There can be other custom scopes provided by Quarkus extensions. For example, `quarkus-narayana-jta` provides `javax.transaction.TransactionScoped`.
ja_jp: Quarkusのエクステンションによって提供される他のカスタムスコープもあります。例えば、 `quarkus-narayana-jta` は `javax.transaction.TransactionScoped` を提供します。

source: There can be other custom scopes provided by Quarkus extensions. For example, xref:transaction.adoc[`quarkus-narayana-jta`] provides xref:transaction.adoc#transaction-scope[`jakarta.transaction.TransactionScoped`].
ja_jp: Quarkusのエクステンションによって提供される他のカスタムスコープもあります。例えば、 xref:transaction.adoc[`quarkus-narayana-jta`] は xref:transaction.adoc#transaction-scope[`jakarta.transaction.TransactionScoped`] を提供します。

source: There could be more tenants, but here we're stopping at two.
ja_jp: 他にもテナントがあるかもしれませんが、ここでは 2 つで止めています。

source: There exist multiple stereotypes of extension, let's list a few.
ja_jp: エクステンションの定型的なタイプは複数存在しますが、いくつか挙げてみましょう。

source: There is a `io.quarkus.runtime.ObjectSubstitution` interface that can be implemented to tell Quarkus how to handle such classes. An example implementation for the `DSAPublicKey` is shown here:
ja_jp: Quarkus にそのようなクラスの処理方法を指示するために実装できる`io.quarkus.runtime.ObjectSubstitution` インターフェイスがあります。 `DSAPublicKey` の実装例を次に示します。

source: There is a convenient way to localize enums. If there is a message bundle method that accepts a single parameter of an enum type and has no message template defined:
ja_jp: 列挙は、便利な方法でローカライズできます。 列挙型の単一のパラメーターを受け入れ、メッセージテンプレートが未定義のメッセージバンドルメソッドがある場合:

source: There is a good chance you will need to define some credentials to access your database.
ja_jp: データベースにアクセスするために、いくつかの認証情報を定義する必要がある可能性があります。

source: There is a https://github.com/oracle/graal/issues/287[GraalVM upstream issue] with some interesting discussions about that topic.
ja_jp: この話題については、 link:https://github.com/oracle/graal/issues/287[GraalVMアップストリーム課題]で興味深い議論が行われています。

source: There is a lot to say about extensions but, in the context of this blog post, we will keep it short. The extension is composed of three Maven modules:
ja_jp: エクステンションについては、いろいろと言いたいことがありますが、このブログ記事の文脈では、短くまとめます。エクステンションは、3つのMavenモジュールで構成されています。

source: There is a simple rule: *exactly one bean must be assignable to an injection point, otherwise the build fails*. If none is assignable the build fails with `UnsatisfiedResolutionException`. If multiple are assignable the build fails with `AmbiguousResolutionException`. This is very useful because your application fails fast whenever the container is not able to find an unambiguous dependency for any injection point.
ja_jp: シンプルなルールがあります: *正確に1つのBeanがインジェクションポイントに割り当て可能でなければならず、そうでなければビルドは失敗します。* 割り当て可能なBeanがない場合、ビルドは `UnsatisfiedResolutionException` で失敗します。複数のBeanが割り当て可能な場合、ビルドは `AmbiguousResolutionException` で失敗します。これは非常に便利です。コンテナーがどのインジェクションポイントに対しても明確な依存関係を見つけることができない場合、アプリケーションは早く失敗するからです。

source: There is also <<convenient-annotation-for-enums,`@TemplateEnum`>> - a convenient annotation to access enum constants in a template.
ja_jp: <<convenient-annotation-for-enums,`@TemplateEnum`>> もあります。これは、テンプレート内の列挙定数にアクセスするために使用できるアノテーションです。

source: There is also a Maven plugin goal that validates the platform properties content and its artifact coordinates and also checks whether the platform properties artifact is present in the platform's BOM. Here is a sample plugin configuration:
ja_jp: また、プラットフォームプロパティのコンテンツとそのアーティファクトの座標を検証し、プラットフォームプロパティのアーティファクトがプラットフォームのBOMに存在するかどうかをチェックするMavenプラグインのゴールもあります。ここでは、プラグインの構成例を示します。

source: There is also a fully worked example in the quickstarts which you may access by cloning the Git repository: `git clone {quickstarts-clone-url}`, or by downloading an {quickstarts-archive-url}[archive]. Look for the `software-transactional-memory-quickstart` example. This will help to understand how you can build STM-aware applications with Quarkus. However, before we do so there are a few basic concepts which we need to cover.
ja_jp: Quickstarts には完全に動作する例もあり、Git リポジトリーを複製してアクセスすることができます。 `git clone {quickstarts-clone-url}` あるいは {quickstarts-archive-url}[archive] をダウンロードしてください。 `software-transactional-memory-quickstart` の例を見てください。これで、Quarkus を使って STM を意識したアプリケーションを構築する方法を説明しています。しかし、その前に、いくつかの基本的な概念を知っておく必要があります。

source: There is also a support to inject Vert.x `RoutingContext` instance into your gRPC service, if / when needed. Quarkus doesn't do that by default, you will need to add `RoutingContextGrpcInterceptor` to your gRPC service.
ja_jp: 必要に応じて、Vert.x の `RoutingContext` インスタンスを gRPC サービスに注入するサポートもあります。Quarkus はデフォルトではこれを実行しないため、`RoutingContextGrpcInterceptor` を gRPC サービスに追加する必要があります。

source: There is also the `quarkus.http.enable-compression` configuration property which enables HTTP response compression globally. If enabled then a response body is compressed if the `Content-Type` HTTP header is set and the value is a compressed media type as configured via the `quarkus.http.compress-media-types` configuration property.
ja_jp: また、HTTPレスポンスの圧縮をグローバルに有効にする設定プロパティ（ `quarkus.http.enable-compression` ）もあります。有効な場合、 `Content-Type` HTTPヘッダが設定され、その値が `quarkus.http.compress-media-types` 設定プロパティで設定された圧縮メディアタイプである場合、レスポンスボディが圧縮されます。

source: There is also the `quarkus.http.enable-compression` configuration property, which enables HTTP response compression globally. If enabled, a response body is compressed if the `Content-Type` HTTP header is set and the value is a compressed media type configured via the `quarkus.http.compress-media-types` configuration property.
ja_jp: また、HTTP レスポンスの圧縮をグローバルに有効にする設定プロパティー (`quarkus.http.enable-compression`) もあります。 有効な場合、`Content-Type` HTTP ヘッダーが設定され、その値が `quarkus.http.compress-media-types` 設定プロパティーで設定された圧縮メディアタイプである場合、レスポンスボディーが圧縮されます。

source: There is an easy way to add a log stream to the footer, without having to create the above mentioned footer. If you just want to stream a log to a tab you can just produce a `FooterLogBuildItem`. This way you only provide a name and a `Flow.Publisher<String>` for your log.
ja_jp: 上記で説明したフッターを作成せずに、ログストリームをフッターに追加できる簡単な方法があります。 ログをタブにストリーミングする必要があるだけであれば、 `FooterLogBuildItem` を作成する以外の操作は必要ありません。この方法では、ログの名前と `Flow.Publisher<String>` のみを指定します。

source: There is an existing `JsonbSerializer` that can be used to serialize all data objects via JSON-B. You may create an empty subclass if you want to use <<serialization-autodetection>>.
ja_jp: JSON-B 経由ですべてのデータオブジェクトをシリアライズするために使用できる既存の `JsonbSerializer` があります。 <<serialization-autodetection>> を使用したい場合は、空のサブクラスを作成できます。

source: There is an existing `ObjectMapperSerializer` that can be used to serialize all data objects via Jackson. You may create an empty subclass if you want to use <<serialization-autodetection>>.
ja_jp: Jackson 経由ですべてのデータオブジェクトをシリアライズするために使用できる既存の `ObjectMapperSerializer` があります。 <<serialization-autodetection>> を使用したい場合は、空のサブクラスを作成します。

source: There is an existing `ObjectMapperSerializer` that can be used to serialize all data objects via Jackson. You may create an empty subclass if you want to use xref:serialization-autodetection[Serializer/deserializer autodetection].
ja_jp: Jackson経由ですべてのデータオブジェクトをシリアライズするために使用できる、既存の `ObjectMapperSerializer` が存在します。 xref:serialization-autodetection[Serializer/deserializerの自動検出] を使用したい場合は、空のサブクラスを作成することができます。
